MindMobius/ai-passport-input-bridge/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 的所有硬件批次均使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 官方兼容分区表:factory 3MB + cardid + permanent Recovery。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Recovery boot hook: hold GPIO0/UP for 5 seconds at boot.
CONFIG_BOOTLOADER_FACTORY_RESET=y
CONFIG_BOOTLOADER_NUM_PIN_FACTORY_RESET=0
CONFIG_BOOTLOADER_FACTORY_RESET_PIN_LOW=y
CONFIG_BOOTLOADER_OTA_DATA_ERASE=y
CONFIG_BOOTLOADER_DATA_FACTORY_RESET=""
CONFIG_BOOTLOADER_HOLD_TIME_GPIO=5

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 本 demo UI 简单,24KB 足够;若自建复杂界面出现绘制卡死/看门狗,调大此值。
CONFIG_LV_MEM_SIZE_KILOBYTES=48
# 示例/Demo 默认会链进固件, Flash 白占 ~100KB+(PERF P2-7)。
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000
# st 控制台命令的全任务栈高水位枚举需要(F3 内存观测)。
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# --- Bluetooth LE / NimBLE(BLE 直连音频外设)---
# 参考 origin/demo/claude-buddy-port 已验证的 NimBLE 配置。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
# 设备只做外设,OBSERVER 关掉(PERF P2-8)。但 CENTRAL 必须留着:
# ble_audio.c 连接建立后要自己发起 ATT MTU 交换(Mac central 从不主动发起),
# 唯一 API 是 ble_gattc_exchange_mtu,而 BT_NIMBLE_GATT_CLIENT 在 Kconfig 里
# depends on BT_NIMBLE_ROLE_CENTRAL —— CENTRAL=n 时 GATT client 整块不编译,
# 链接直接报 undefined reference to `ble_gattc_exchange_mtu'。
# GATT_MAX_PROCS 压到 2(默认 4):客户端过程只用来做那一次 MTU 交换。
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_GATT_CLIENT=y
CONFIG_BT_NIMBLE_GATT_MAX_PROCS=2
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY=n
CONFIG_BT_NIMBLE_UTIL_API=y
# Just Works 配对(SC 无 MITM,无需输 PIN);macOS 主动发起,此配置让配对兜底
# (代码侧需 ble_store_config_init 持久化 bond)。
CONFIG_BT_NIMBLE_SM_LEGACY=n
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
# 协商 ATT MTU 517(含 3B 头 → 载荷 514B):3200B 音频帧 = 7 片(6×514+116),
# 分片远少于 MTU 247 的 14 片,显著降低 NOTIFY_TX 流控开销(吞吐工程,见 design.md)。
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517
# MSYS mbuf 池:默认 MSYS_2 为 320B×24 块,514B 载荷需 2 块链接才放得下,
# 并发分片下池易耗尽(ble_hs_mbuf_from_flat 失败 → 整帧丢弃,见第 5 轮 #1)。
# 640B = 514B 载荷 + mbuf/pkthdr 头(~44B) + 余量,单片一块、链接归零。
# 4×640B ≈ 2.5KB 静态 RAM(替换默认 24 块 320B = 7,680B,省 ~5KB)。
# 注:IDF 5.5 真实符号为 BLOCK_SIZE/BLOCK_COUNT(旧 CONFIG_BT_NIMBLE_MSYS_2_BUF_SIZE
# 静默失效,审查 P1);实际池行为真机验证(NOT RUN)。
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_SIZE=640
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=4
# 日志级别锁在生产值 INFO。NimBLE DEBUG 会把每个 HCI 字节打成一行,
# 音频流期间压吞吐并抬 CPU(2026-08-27 串口实抓)。抓包时临时改,别提交。
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_BT_NIMBLE_LOG_LEVEL_INFO=y
# MSYS_1(256B 块)是音频分片的在途上限:一片 ≤253B 占一块。默认 4 块 → 一帧
# 804B(5 片)第 5 片就分配不到 mbuf,配合旧代码"首片失败即整帧作废",实测
# 40 帧只到 3 帧(design.md §3)。24 块 = 6KB 静态 RAM,换来 24 片在途余量。
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=24

# 电源管理(2026-08-28 功耗优化 #1;2026-08-29 回退后重新启用):空闲时 CPU 变频 +
# 自动 light sleep(modem sleep 保留 BLE 连接)。录音会话由 main.c 的 esp_pm_lock
# 阻止睡眠并保持高频(见 app_main: pm_session_lock/unlock),空闲满 1 分钟才真正
# 放手省电(pm_idle_gate_check)。
# 回退过一轮:调 BLE 说话即崩溃时先怀疑 light sleep,把整块删掉做对照(journal
# 2026-08-29)。结论是与该崩溃无关(根因是内存耗尽 + mbuf 丢帧),故按用户要求
# 在真机恢复正常后重新打开。
CONFIG_PM_ENABLE=y
# light sleep 需要 tickless idle(esp_pm_configure 的 light_sleep_enable 依赖)
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# BT modem sleep(2026-08-28 功耗优化 #1.1):事件间控制器睡眠,BT 启用时 light sleep 才能应用。
# 板无外部 32k 晶振;内部 136k RC 精度远超 500ppm,Kconfig 明确禁止用于 BLE 连接态,
# 故用主晶振(40M)分频做 BT 睡眠时钟 —— 官方支持 连接 + light sleep + DFS 的组合。
CONFIG_BT_CTRL_MODEM_SLEEP=y
CONFIG_BT_CTRL_LPCLK_SEL_MAIN_XTAL=y
# 关键(2026-08-28 真机崩溃根因):无此项时 bt.c 置 no_light_sleep=1 但创建的
# btLS NO_LIGHT_SLEEP 锁从未 acquire → light sleep 在 BT 启用时照样应用 →
# BLE 连接事件错过 → esp_restart 复位循环(复位原因 4)。开启后主晶振在
# light sleep 期间保持供电,BT 参考时钟不断(代价:睡眠多耗几百 µA,可接受)。
CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP=y

